//חבילות השיעורים ומאפיניהן
let packages = [
    { "id": 4, "name": "לפי שמיעה", "price": 45 },
    { "id": 5, "name": "לפי צבעים", "price": 45 },
    { "id": 6, "name": "לפי תווים", "price": 59 }]

//חבילות סגנון השירים ומאפיניהם
let typeSongs = [
    { "id": 8, "name": "קלאסי", "price": 20 },
    { "id": 9, "name": "חסידי", "price": 25 },
    { "id": 10, "name": "מזרחי", "price": 25 }]

//מערכי השירים
let s1 = ["a0", "c1", "e1", "d1", "c1", "d1", "c1", "a0", "a0", "c1", "e1", "d1", "c1", "d1", "c1", "a0", "c1", "e1", "d1", "c1", "d1", "c1", "a0", "d1", "c1", "e1", "d1", "c1", "b0", "a0", "a1", "a1", "g1", "a1", "g1", "f1", "e1", "d1", "f1", "g1", "a1", "a1", "g1", "f1", "e1", "a1", "a1", "g1", "a1", "g1", "f1", "e1", "d1", "d1", "d1", "d1", "c1", "e1", "d1", "c1", "b0", "a0"]//מערך תווים מה אהבתי תורתך
let s2 = ["e0", "a0", "a0", "a0", "g0", "a0", "b0", "a0", "b0", "e0", "g0", "g0", "g0", "e0", "g0", "b0", "g0", "a0", "a0", "c1", "c1", "c1", "c1", "d1", "e1", "c1", "d1", "c1", "b0", "a0", "c1", "b0", "a0", "g0", "b0", "a0", "c1", "e1", "e1", "e1", "c1", "e1", "g1", "e1", "d1", "b0", "d1", "d1", "d1", "b0", "d1", "f1", "d1", "c1", "a0", "c1", "c1", "c1", "c1", "d1", "e1", "c1", "d1", "c1", "b0", "a0", "c1", "b0", "a0", "g0", "b0", "a0"]//מערך תווים  קלי אתה
let s3 = ["d1", "d1", "d1", "b0", "c1", "b0", "a0", "d1", "d1", "d1", "b0", "c1", "b0", "a0", "g0", "a0", "b0", "c1", "c1", "d1", "a0", "b0", "a0", "g0", "a0", "a0", "d1", "d1", "b0", "c1", "a0", "d1", "d1", "b0", "c1", "g0", "a0", "b0", "c1", "c1", "d1", "a0", "b0", "a0", "g0", "a0"]//מערך תווים ישמח חתני
let s4 = ["e1", "f1", "g1", "g1", "f1", "e1", "d1", "c1", "c1", "d1", "e1", "e1", "d1", "e1", "f1", "g1", "g1", "f1", "e1", "d1", "c1", "c1", "d1", "e1", "d1", "c1", "d1", "e1", "c1", "d1", "d1", "e1", "c1", "d1", "f1", "e1", "d1", "c1", "d1", "g1", "e1", "e1", "f1", "g1", "g1", "f1", "e1", "d1", "c1", "c1", "d1", "e1", "d1", "c1"]//מערך תווים הסימפוניה התשיעית
let s5 = ["a0", "b0", "c1", "b0", "b0", "a0", "c1", "a0", "a0", "a0", "a0", "b0", "c1", "b0", "b0", "a0", "c1", "a0", "b0", "c1", "b0", "b0", "a0", "c1", "a0", "a0", "a0", "a0", "b0", "c1", "b0", "b0", "a0", "a0", "c1", "d1", "e1", "d1", "d1", "c1", "e1", "c1", "c1", "c1", "c1", "d1", "e1", "d1", "d1", "c1", "e1", "c1", "d1", "e1", "d1", "d1", "c1", "e1", "c1", "c1", "c1", "a0", "b0", "c1", "b0", "b0", "a0", "a0"]//ימים על ימי מלך
let s6 = ["g0", "c1", "c1", "c1", "d1", "c1", "d1", "e1", "g1", "f1", "e1", "d1", "f1", "e1", "d1", "c1", "g0", "c1", "c1", "c1", "d1", "c1", "d1", "e1", "g1", "f1", "e1", "d1", "f1", "e1", "f1", "e1", "f1", "e1", "d1", "c1", "d1", "e1", "d1", "c1", "e1", "d1", "c1", "g1", "f1", "e1", "f1", "e1", "d1", "c1", "d1", "e1", "d1", "c1", "e1", "d1", "c1", "b0", "d1", "c1"]//מערך תווים כי אשמרה שבת
let s7 = ["d1", "b0", "d1", "d1", "d1", "d1", "b0", "d1", "e1", "d1", "c1", "b0", "a0", "g0", "g0", "a0", "a0", "g0", "g0", "a0", "g0", "c1", "b0", "a0", "b0", "g0", "g0", "a0", "a0", "g0", "g0", "a0", "g0", "c1", "b0", "a0", "g0"]//מערך תווים דוד מלך ישראל
let s8 = ["c0", "c0", "g0", "g0", "a0", "a0", "g0", "f0", "f0", "e0", "e0", "d0", "d0", "c0", "g0", "g0", "f0", "f0", "e0", "e0", "d0", "g0", "g0", "f0", "f0", "e0", "e0", "d0"]// מערך תווים אי בי סי
let s9 = ["g0", "c1", "e1", "g0", "c1", "e1", "e1", "d1", "d1", "d1", "d1", "e1", "f1", "f1", "f1", "g1", "f1", "e1", "d1", "e1", "e1", "e1", "e1", "e1", "f1", "f1", "f1", "a1", "f1", "f1", "e1", "c1", "e1", "g1", "g1", "g0", "b0", "d1", "f1", "e1", "d1", "c1", "c1", "c1", "c1"]// מערך תווים  האוטו שלנו

//השירים ומאפיניהם
let songs = [
    { "id": 1, "type": 8, "name": "הסימפוניה התשיעית", "tavim": s4 },
    { "id": 2, "type": 8, "name": "A.B.C.", "tavim": s8 },
    { "id": 3, "type": 8, "name": "האוטו שלנו", "tavim": s9 },
    { "id": 4, "type": 9, "name": "ימים על ימי מלך", "tavim": s5 },
    { "id": 5, "type": 9, "name": "מה אהבתי תורתך", "tavim": s1 },
    { "id": 6, "type": 9, "name": "קלי אתה", "tavim": s2 },
    { "id": 7, "type": 10, "name": "ישמח חתני ", "tavim": s3 },
    { "id": 8, "type": 10, "name": "כי אשמרה שבת", "tavim": s6 },
    { "id": 9, "type": 10, "name": "דוד מלך ישראל", "tavim": s7 }]

